<html>
<title>Duro D/T Tutorial</title>
<link rel="stylesheet" href="../style.css">
<body>
<p><a href="../index.html">Documentation home</a>
<h1>Duro D/T Tutorial</h1>

<h2>Table of contents</h2>

<ul>
<li><a href="#intro">Introduction</a>
<li><a href="#invoke">Invoking the interpreter</a>
<li><a href="#declare">Declaring variables</a>
<li><a href="#assign">Assignment</a>
<li><a href="#types">Built-in types</a>
<li><a href="#comments">Comments</a>
<li><a href="#control">Control statements</a>
<li><a href="#tuples">Tuples</a>
<li><a href="#dbs">Databases, database environments, and transactions</a>
<li><a href="#tables">Tables</a>
<li><a href="#dbconstraints">Database constraints</a>
<li><a href="#arrays">Arrays</a>
<li><a href="#for_in">FOR .. IN</a>
<li><a href="#io">I/O</a>
<li><a href="#datetime">Date and time</a>
<li><a href="#user-ops">User-defined operators</a>
<li><a href="#user-types">User-defined types</a>
<li><a href="#subtyping">Subtyping</a>
<li><a href="#exception">Exception handling</a>
<li><a href="#packages">Packages</a>
<li><a href="#performance">Performance</a>
</ul>

<h2 id="intro">Introduction</h2>

<p>Duro D/T is an interpreter which supports accessing and updating DuroDBMS databases.
Being computationally complete, it can be used to write database applications.
The language is very close to the Tutorial D language proposed by C. J. Date and Hugh Darwen
in their book <em>The Third Manifesto</em> (<cite>TTM</cite>).

<p>Consult <a href="http://www.thethirdmanifesto.com/">The Third Manifesto website</a>
for more information on <cite>TTM</cite> and Tutorial D.

<h2 id="invoke">Invoking the interpreter</h2>

<p>To invoke the interpreter, type <samp>durodt</samp>:

<p>(Assuming the directory containing the durodt binary has been added to the system path)

<pre>
durodt
Duro D/T library version 1.2
Implicit transactions enabled.
no db>
</pre>

<p>Duro D/T displays a prompt with the database currently
in use. Since no database is selected in the example shown above,
the prompt is "no db".

<p>To exit the interpreter, type the end-of-file character
(Control-Z on Windows, Control-D on POSIX systems) or type "exit();".
(Do not forget the parentheses and the semicolon)

<p>For more information about invoking Duro D/T see <a href="../utils.html#durodt">DuroDBMS utilities</a>.

<h2 id="declare">Declaring variables</h2>

<p>In Duro D/T, variables are typed, as required by <cite>TTM</cite>.
They must be declared before they can be used.

<p>Example:

<pre>
no db> var i integer;
no db>
</pre>

<p>This creates a variable named i. Note that Duro D/T is case
insensitive, so there is no diffence between "var i integer;"
and "VAR I INTEGER;". More precisely, keywords are case insensitive
whereas identifiers are automatically converted to lowercase.
This tutorial shows example code in lowercase.

<p>When declaring a variable, an initial value can be specified:

<pre>
no db> var j integer init 2;
no db>
</pre>

<p>If an initial value is provided, the type can be omitted.
So the above can also be written as follows:

<pre>
no db> var j init 2;
no db>
</pre>

<p>If an initial value is not specified, the variable is
automatically initialized to a default value, which is
zero for numeric types, the empty string for the type <code>string</code>
and FALSE for <code>boolean</code>.

<p>A variable can also be declared to have the same type
as some other variable. Example:

<pre>
no db> var k same_type_as(i);
no db>
</pre>

<p>Variables can be explicity destroyed. This is usually not necessary for transient variables,
but is supported for all user-declared variables:

<pre>
no db> drop var k;
no db>
</pre>

<h3>Constants</h3>

<p>Symbolic constants can be created using CONST:

<pre>
no db> const pi 3.141592653;
no db>
</pre>

<h2 id="assign">Assignment</h2>

<p>Once a variable has been declared, a value can be assigned
to it. For example:

<pre>
no db> i := 5;
1 element affected.
no db>
</pre>

<p>Duro D/T supports <strong>multiple assignment</strong>,
i.e. more than one assignment in one statement.
A multiple assignment behaves as if the individual assignments
were executed in parallel.

<p>For example, to exchange the values of two variables,
one can write:

<pre>
no db> i := j, j := i;
2 elements affected.
no db>
</pre>

<h2 id="types">Built-in types</h2>

<p>DuroDBMS supports the following built-in basic scalar types:

<ul>
<li><code>boolean</code> (synonym <code>bool</code>)</li>
<li><code>integer</code> (synonym <code>int</code>)</li>
<li><code>float</code> (synonyms <code>rational</code>, <code>rat</code>)</li>
<li><code>string</code> (synonym <code>char</code>)</li>
<li><code>binary</code></li>
</ul>

<p>Examples:

<pre>
no db> var b bool init true;
no db> var i int init 1;
no db> var f float init 1.0;
no db> var s string init 'Foo';
no db> var bin binary init X'466f6f';
</pre>

<p>There are other built-in types used for I/O, date/time and exception handling.
These are discussed in the respective sections.

<p>For non-scalar types, see the chapters on tuples, tables, and arrays,
respectively.

<p>DuroDBMS supports the usual arithmetical operators. Example:

<pre>
no db> io.put_line(cast_as_string(2 + 3 * 4));
14
no db>
</pre>

<p>cast_as_&lt;type&gt; is the type conversion operator.
Here it is used to convert the integer result to a string.
In Duro D/T, type conversion is always explicit.

<p>For details on the built-in operator <code>io.put_line</code>, see the chapter on I/O below.

<h2 id="comments">Comments</h2>

<p>Duro D/T supports end-of-line comments and block comments.

<pre>
var i int; -- This is an end-of-line comment.

/* This is a
block
comment. */
</pre>

<p>End-of-line comments and block comments which span several lines are not supported in interactive mode.

<p>Lines starting with #! are ignored to allow for Unix interpreter files.</p>

<h2 id="control">Control statements</h2>

<h3>IF</h3>

<p>Example:

<pre>
no db> var s string;
no db> io.put_line('Please enter a number:'); io.get_line(s);
Please enter a number:
2
no db> var n init cast_as_integer(s);
no db> if n &lt; 0 then
no db>     io.put_line('Negative');
no db>     io.put_line('Sign is -');
no db> else
no db>     io.put_line('Positive');
no db>     io.put_line('Sign is +');
no db> end if;
Positive
Sign is +
no db>
</pre>

<p>In Duro D/T, BEGIN .. END is not required since there can be several statements after THEN.
But the following form, which more strictly adheres to <cite>TTM</cite>, is supported too:</P>

<pre>
no db> var s string;
no db> io.put_line('Please enter a number:'); io.get_line(s);
Please enter a number:
-2
no db> var n init cast_as_integer(s);
no db> if n &lt; 0 then
no db>     begin;
no db>         io.put_line('Negative');
no db>         io.put_line('Sign is -');
no db>     end;
no db> else
no db>     begin;
no db>         io.put_line('Positive');
no db>         io.put_line('Sign is +');
no db>     end;
no db> end if;
Negative
Sign is -
no db>
</pre>

<h3>FOR</h3>

<p>Example:</p>

<pre>
var i integer;
for i := 1 to 5;
    io.put(i);
    io.put_line('');
end for;
1
2
3
4
5
no db>
</pre>

<p>DO may be used instead of FOR.

<h3>WHILE</h3>

<p>Example:

<pre>
var s string;
var n integer;

io.get_line(s);
n := cast_as_integer(s);
while n < 0;
    io.put_line('This number is not positive. Please enter again:');
    io.get_line(s);
    n := cast_as_integer(s);
end while;
</pre>

<p>This code reads one line of input until you enter a positive number.
(Or a string which is not a number which will result in an <code>invalid_argument_error</code>)

<p>It is possible to exit a loop using the LEAVE statement. Example:

<pre>
no db> var s string;
no db> while true;
no db>     io.put('type "exit" to exit: ');
no db>     io.get_line(s);
no db>     if s = 'exit' then
no db>         leave;
no db>     end if;
no db> end while;
type "exit" to exit: x
type "exit" to exit: exit
no db> 
</pre>

<p>LEAVE with a statement name (label) is also supported.
See <cite>TTM</cite>, chapter 5 for details.

<h3>CASE</h3>

<p>Example:

<pre>
no db> var s string;
no db> var n integer;
no db> io.put_line('Please enter a number:'); io.get_line(s);
Please enter a number:
0
no db> n := cast_as_integer(s);
no db> case
no db>     when n > 0 then
no db>         io.put_line('Positive');
no db>     when n < 0 then
no db>         io.put_line('Negative');
no db>     else
no db>         io.put_line('Zero');
no db> end case;
Zero
no db>
</pre>

<h2 id="tuples">Tuples</h2>

<p>Tuple variables can be declared as follows:</p>

<pre>
no db> var tp tuple { i integer, s string };
no db>
</pre>

<p>TUP can be used as a synonym for TUPLE.
Like scalar variables, tuple variables can be explicitly initialized
when they are declared:</p>

<pre>
no db> var tp tup { i integer, s string } init tup { i 1, s 'One' };
no db>
</pre>

Or shorter:

<pre>
no db> var tp init tup { i 1, s 'One' };
no db>
</pre>

<p>Tuple assignment:

<pre>
no db> tp := tup { i 2, s 'Two' };
1 element affected.
</pre>

Note that as required by <cite>TTM</cite> proscription 1 there is no attribute
ordering in Duro D/T, so the statement above is perfectly equivalent
to the following:

<pre>
no db> tp := tup { s 'Two', i 2 };
1 element affected.
</pre>

<p>Tuple update:

<pre>
no db> update tp { i := 3 };
1 element affected.
no db> update tp { i := 4, s := 'Four' };
1 element affected.
</pre>

<p>Accessing tuple attributes:

<pre>
no db> io.put_line(tp.s);
Four
no db>
</pre>

<p>Alternative form:

<pre>
no db> io.put_line(s from tp);
Four
no db>
</pre>

<h2 id="dbs">Databases, database environments, and transactions</h2>

<p>Database environments are the places where databases and tables are physically stored.
Therefore a database environment must exist before a database can be created.
In Duro D/T, a database environment can be created using the built-in
update operator create_env():</p>

<pre>
no db> create_env('dbenv');
no db>
</pre>

<p>The built-in update operator connect() can be used to connect
to an existing database environment. connect() takes one argument
of type <code>string</code> which specifies the database environment:</p>

<pre>
no db> connect('dbenv');
no db>
</pre>

<p>A DuroDBMS database environment is implemented using
a Berkeley DB database environment.
The Berkeley DB command line utilities can be used for
tasks like backup, recovery etc.   

<p>After a database environment was created and/or connected to, a
database can be created using the built-in
update operator create_db().</p>

<pre>
no db> create_db('D');
no db>
</pre>

<p>The variable <code>current_db</code> contains the database currently in use.
A database can be selected by assigning the variable:</p>

<pre>
no db> current_db := 'D';
1 element affected.
D>
</pre>

<p>After <code>current_db</code> has been set, the prompt shows the name
of the database selected and a transaction can be started
using BEGIN TRANSACTION. Instead of BEGIN TRANSACTION, BEGIN TX
can be used:</p>

<pre>
D> begin tx;
Transaction started.
D>
</pre>

<p>Transaction commit:

<pre>
D> commit;
Transaction committed.
D>
</pre>

<p>Transaction rollback:

<pre>
D> begin tx;
Transaction started.
D> rollback;
Transaction rolled back.
D>
</pre>

<p>If implicit transactions are enabled, no transaction
is running and the value of <var>current_db</var> is not the empty string, 
the execution of each statement will be preceded by an implicit
<em>begin transaction</em> and followed by an implicit <em>commit</em>
(if the statement executed successfully) or <em>rollback</em> (otherwise).

<p>In interactive mode, implicit transactions are enabled by default.
Implicit transactions can be enabled and disabled by setting the variable <var>implicit_tx</var>
to TRUE or FALSE, respectively.

<p>The following examples assume that implicit transactions are enabled.

<h2 id="tables">Tables</h2>

<p>As required by <cite>TTM</cite>, tables are variables in DuroDBMS,
thus a table is created by declaring a variable. 

<h3>Real tables</h3>

<p>Creating a real table:

<pre>
D> var items real relation { itemno int, name string, price float } key { itemno };
Table items created.
D>
</pre>

<p>REL can be used as a synonym for RELATION.

<p>It is possible to specify default values when creating a table. Example:

<pre>
D> var items2 real rel { itemno int, name string, price float } key { itemno } default { price 0.0 };
Table items2 created.
D> insert items2 tup { itemno 1, name 'Sunglasses' };
1 element affected.
</pre>

<p><em>serial()</em> can be used as a default value. In this case, the attribute value
will be obtained automatically.</p>

<p>Example:</p>

<pre>
D> var items3 real rel { itemno int, name string, price float } key { itemno } default { itemno serial() };
Table r3 created.
D> insert items3 tup { name 'Bag', price 19.95 };
1 element affected.
D> insert items3 tup { name 'Hat', price 25.0 };
1 element affected.
D> io.put(items3); io.put_line('');
RELATION {TUPLE {itemno 2, name 'Hat', price 25.0}, TUPLE {itemno 1, name 'Bag', price 19.95}}
D>
</pre>

<h3>Private tables</h3>

<p>Private tables are transient, they do not belong to any database
and do not require a transaction to create or access them.

<p>Creating a private table:

<pre>
D> var p private rel { no int, name string } key { no };
Local table p created.
D>
</pre>

<h3>Virtual tables (aka views)</h3>

<p>Creating a virtual table:

<pre>
D> var cheap_item_names virtual items where price < 5.0 { name };
Table cheap_item_names created.
D>
</pre>

<p>This creates a view which contains the names of all items with a price lower than 5.

<h3>Public tables</h3>

<p>DuroDBMS supports public tables as a means to provide logical data independence,
separating the application from the database.

<p>A public table can be defined as follows:

<pre>
D> var app_items public relation { itemno int, name string, price float } key { itemno };
Public table app_items created.
D> 
</pre>

<p>Before a public table can be used, a mapping between it and and one or more database
tables must be defined. This can be done using the MAP operator.

<p>A simple example (using the table <var>items</var> defined above):

<pre>
D> map app_items items2;
D>
</pre>

<h3>Insert, update, delete</h3>

<p>Inserting a single tuple:</p>

<pre>
D> insert items tup { itemno 1, name 'Wallet', price 15.0 };
1 element affected.
D>
</pre>

<p>Inserting several tuples:</p>

<pre>
D> insert items rel { tup { itemno 2, name 'T-Shirt', price 23.99 },
                      tup { itemno 3, name 'Cap', price 18.99 } };
2 elements affected.
D>
</pre>

<p>Updating a table:</p>

<pre>
D> update items where itemno = 3 { itemno := 4, name := 'Baseball cap' };
1 element affected.
D>
</pre>

<p>Deleting tuples from a table:</p>

<pre>
D> delete items where itemno = 4;
1 element affected.
D> delete items tup { itemno 2, name 'T-Shirt', price 23.99 };
1 element affected.
D>
</pre>

<p>Tables can be destroyed just as other variables using DROP VAR:

<pre>
D> drop var cheap_item_names;
Table cheap_item_names dropped.
D> drop var items;
Table items dropped.
D>
</pre>

<h3>Renaming a table</h3>

<p>A table can be renamed using RENAME VAR:</p>

<pre>
D> rename var items3 as itemsn;
Table items3 renamed.
D>
</pre>

<p>This works only for persistent tables.

<h2 id="dbconstraints">Database constraints</h2>

<p>Duro D/T supports database constraints.

<h3>A simple example</h3>

<p>Let's say we have a table which we want to contain no more than 2 tuples.
This can be realized as follows:

<pre>
D> var t real rel { n int, s string } key { n };
Table t created.
D> constraint cr count(t) <= 2;
Constraint cr created.
D> insert t tup { n 1, s 'one' };
1 element affected.
D> insert t tup { n 2, s 'two' };
1 element affected.
D> insert t tup { n 3, s 'three' };
predicate_violation_error: cr
D> 
</pre>

<h3>A more complex example</h3>

<p>Imagine there is one table for customers and one for orders:</p>

<pre>
D> var customers real rel { customer_id int, name string } key { customer_id };
Table customers created.
D> var orders real rel { order_id int, customer_id int } key { order_id };
Table orders created.
D> 
</pre>

<p>If we only want to allow orders with a corresponding customer, this can
be achieved using a database constraint as follows:

<pre>
D> constraint orders_customers orders { customer_id } subset_of customers { customer_id };
Constraint orders_customers created.
D> 
</pre>

<p>If we now want to insert an order, DuroDBMS will check if there
is a corresponding entry in the customer table: 

<pre>
D> insert orders tup { order_id 1, customer_id 1 };
predicate_violation_error: orders_customers
D> insert customers tup { customer_id 1, name 'John Smith' };
1 element affected.
D> insert orders tup { order_id 1, customer_id 1 };
1 element affected.
D> 
</pre>

<p>DuroDBMS performs constraint checking before a statement is executed.
To achieve this, DuroDBMS generates an expression which will return TRUE
if the statement will not violate the expression and FALSE if it will.
Duro tries to optimize this expression before evaluating.

<p>An EXPLAIN statement can be used to obtain the expression which is evaluated
in order to check a constraint. Example:

<pre>
D> explain insert orders tup { order_id 1, customer_id 1 };
check orders_customers: is_empty((RELATION {} union ((RELATION {TUPLE {customer_id 1, order_id 1}}
{ customer_id }) minus (customers INDEX customers$0 { customer_id }))) {  })
D> 
</pre>

<p>The expression is a little complicated, but one can see that the reference to table <var>orders</var>
has been eliminated. The expression simply checks if the customer_id of the tuple to be inserted
already appears in <var>customers</var>.

<p>A constraint can be deleted using DROP CONSTRAINT:

<pre>
D> drop constraint orders_customers;
Constraint orders_customers dropped.
D>
</pre>

<h3>Transition constraints</h3>

<p>A constraint may refer to the value of a table as it was prior to the update
by adding a ' (apostrophe) to the name of the table.

<p>For example, if we have a table defined as follows:

<pre>
D> var rs real rel { id int, status int } key { id };
Table rs created.
D>
</pre>

<p>The following constraint says that the value of the attribute <var>status</var> may never decrease:

<pre>
D> constraint trc is_empty(((rs' rename { status as status' }) join rs) where status' > status);
Constraint trc created.
D> insert rs tup { id 1, status 0 };
1 element affected.
D> update rs where id = 1 { status := 1 };
1 element affected.
D> update rs where id = 1 { status := 0 };
predicate_violation_error: trc
</pre>

<h2 id="arrays">Arrays</h2>

<p>Example: Printing all tuples of table r in an unspecified order:

<pre>
D> var a array tup same_heading_as(r);
D> load a from r order();
D> var i integer;
D> for i:= 0 to length(a) - 1;
D>   io.put(a[i]); io.put_line('');
D> end for;
</pre>

<h2 id="for_in">FOR .. IN</h2>

<p>Duro D/T supports a second FOR statement which iterates over all tuple values of a table.
The example below prints all tuples of table r in an unspecified order
using FOR instead of using LOAD: 

<pre>
D> var tp tup same_heading_as(r);
D> for tp in r order();
D>   io.put(tp); io.put_line('');
D> end for;
</pre>

<h2 id="io">I/O</h2>

<p>Duro D/T provides a number of I/O operators.

<h3>io.put_line</h3>

<p><code>io.put_line</code> is an update operator that takes one argument
of type <code>string</code> and prints it on standard output, followed by a newline.

<pre>
no db> io.put_line('hello');
hello
no db>
</pre>

<p>Note that in Duro D/T, the keyword CALL in update operator invocations
is optional. The following is also valid:

<pre>
no db> call io.put_line('hello');
hello
no db>
</pre>

<h3>io.put</h3>

<p><code>io.put</code> works like <code>io.put_line</code>, except that its output is not
followed by a newline. Unlike <code>io.put_line</code>, it is defined
for all built-in basic data types and also for tuple and relation arguments:

<pre>
no db> io.put('2 + 2 = '); io.put(2 + 2); io.put_line('');
2 + 2 = 4
no db> io.put(true); io.put_line('');
TRUE
no db> io.put(tup {a 1, b 'bee'}); io.put_line('');
TUPLE { a 1, b 'bee' }
no db> io.put(rel {tup {I 1, C 'foo'}, tup {I 2, C 'bar'}}); io.put_line('');
RELATION { TUPLE { i 1, c 'foo' }, TUPLE { i 2, c 'bar' }}
no db>
</pre>

<h3>io.get_line</h3>

<p><code>io.get_line</code> is defined as follows:</p>

<p>PACKAGE io;

<p>OPERATOR get_line(line string) UPDATES { line };</p>

<p>END PACKAGE;

<p><code>io.get_line</code> reads one line from standard input and stores
it in <code>line</code>, without the trailing newline.</p>

<p>File I/O is also supported. See the <a href="../api/html/io-ops.html">list of I/O operators</a>.

<p>The following example code reads lines from standard input and writes
them to standard output in sorted order:

<pre>
var lines private relation { lineno int, line string } key { lineno };
var l string;

-- Read input lines
var lno init 0;
while true;
    io.get_line(l);
    -- Leave loop on EOF
    if io.eof() then
        leave;
    end if;
    insert lines tup { lineno lno, line l };
    lno := lno + 1;
end while;

-- Write lines in sorted order
var lt tup same_heading_as(lines);
for lt in lines order(line asc);
    io.put_line(lt.line);
end for;
</pre>

<h2 id="user-ops">User-defined operators</h2>

<p>Defining a read-only operator:

<pre>
D> operator incr(i integer) returns integer;
D> return i + 1;
D> end operator;
Read-only operator incr created.
D> io.put(incr(1)); io.put_line('');
2
D>
</pre>

<p>Defining an update operator:

<pre>
D> operator inc(i integer) updates { i };
D> i := i + 1;
D> end operator;
Operator inc created.
D> var n init 1;
D> inc(n);
D> io.put(n); io.put_line('');
2
D>
</pre>

<p>Dropping an operator:

<pre>
D> drop operator incr;
Operator incr dropped.
D>
</pre>

<h2 id="datetime">Date and time</h2>

<p>DuroDBMS provides a type datetime which is defined as follows:

<pre>
TYPE datetime
POSSREP {
    year integer,
    month integer,
    day integer,
    hour integer,
    minute integer,
    second integer
}; 
</pre>

<p>The read-only operators now() and now_utc() return the current time.
now() returns the current time as a local time whereas now_utc() returns the UTC time.

<p>Example:

<pre>
no db> var d datetime;
no db> d := now();
1 element affected.
no db> io.put_line(cast_as_string(d));
2015-05-18T14:15:29
no db> d := now_utc();
1 element affected.
no db> io.put_line(cast_as_string(d));
2015-05-18T12:15:51
no db> 
</pre>

<h2 id="user-types">User-defined types</h2>

<p>Imagine we have employee numbers which start with the character 'E'
followed by one or more digits.

<p>We can define a type for this purpose as follows:

<pre>
D> type empno possrep { no string }
D> constraint no regex_like '^E[0-9]+$' or no = ''
D> init empno('');
Type empno defined.
D> 
</pre>

<p>We also allow the empty string if there is no employee number to store.
It may be a good idea to allow only values of a certain (fixed) length;
this is omitted here to keep the example simple.

<p>Before the type can be used, it must first be implemented.
This can be done using IMPLEMENT TYPE:

<pre>
D> implement type empno; end implement;
Type empno implemented.
</pre>

<p>After a type has been defined and implemented,
it can be used to declare and assign variables. Example:

<pre>
D> var empno empno;
D> empno := empno('1234');
type_constraint_violation_error: empno
D> empno := empno('A1234');
type_constraint_violation_error: empno
D> empno := empno('E1234');
1 element affected.
D> io.put_line(empno.no);
E1234
D> 
</pre>

<p>The <var>no</var> property can also be accessed using a the_ operator:

<pre>
D> io.put_line(the_no(empno));
E1234
D> 
</pre> 

<p>Things are getting a little more complex if a user-defined type has more
than one possible representation.
In this case, an actual representation must be specified together with
selector, getter, and setter operators which provide
the mapping between the possible representations and the actual representation.
These operators are accessing the actual representation.

<p>Note that the type constraint is specified for the entire type and not
for the individual possreps, as opposed to <cite>TTM</cite>.

<p>The example code below shows how the type POINT from <cite>TTM</cite>, chapter 3,
can be implemented using Duro D/T.

<pre>
type point
    possrep cartesian { x float, y float }
    possrep polar { r float, theta float }
    init cartesian(0.0, 0.0);

implement type point as tuple { x float, y float };

    operator cartesian(x float, y float) returns point;
        return tuple { x x, y y };
    end operator;

    operator get_x(p point) returns float;
        return p.x;
    end operator;

    operator get_y(p point) returns float;
        return p.y;
    end operator;

    operator set_x(p point, x_ float) updates { p };
        update p { x := x_ };
    end operator;

    operator set_y(p point, y_ float) updates { p };
        update p { y := y_ };
    end operator;

    operator polar(r float, theta float) returns point;
        return tuple { x r * cos(theta), y r * sin(theta) };
    end operator;

    operator get_r(p point) returns float;
        return sqrt(p.x * p.x + p.y * p.y);
    end operator;

    operator set_r(p point, r float) updates { p };
        var theta init atan2(p.y, p.x);

        update p { x := cos(theta) * r, y := sin(theta) * r };
    end operator;

    operator set_theta(p point, theta float) updates { p };
        var r init sqrt(p.x * p.x + p.y * p.y);

        update p { x := cos(theta) * r, y := sin(theta) * r };
    end operator;

    operator get_theta(p point) returns float;
        return atan2(p.y, p.x);
    end operator;

end implement;
</pre>

<p>Usage examples:

<pre>
D> var p point;
D> p := cartesian(1.0, 1.0);
1 element affected.
D> io.put(p.x); io.put_line('');
1.0
D> io.put(p.y); io.put_line('');
1.0
D> io.put(p.r); io.put_line('');
1.4142135624
D> io.put(p.theta); io.put_line('');
0.7853981634
D> 
</pre>

<h2 id="subtyping">Subtyping</h2>

<p>With version 1.2, Duro D/T supports subtyping, however,
suptyping support is limited in that only dummy types can be supertypes.

<p>The following example code creates a parent type and two subtypes:

<pre>
D> type shape union;
Type shape defined.
D> type circle is shape possrep { radius int } init circle(0);
Type circle defined.
D> type rectangle is shape possrep { width int, height int } init rectangle(0,0);
Type rectangle defined.
D> implement type circle;
D> end implement;
Type circle implemented.
D> implement type rectangle;
D> end implement;
Type rectangle implemented.
D> 
</pre>

<p>Note that the parent type must be declared as a union type and that
it must not be implemented.

<p>Duro D/T supports type testing and TREAT (see <cite>TTM</cite>, IM prescription 14).

<p>Example:

<pre>
D> var s shape init circle(1);
D> io.put(is_circle(s)); io.put_line('');
TRUE
D> io.put(treat_as_circle(s).radius); io.put_line('');
1
D> 
</pre>

<h3>Subtyping with read-only operators</h3>

<p>Example:

<pre>
D> operator area(s shape) returns integer;
D> end operator;
Read-only operator area created.
D> operator area(r rectangle) returns integer;
D> return r.width * r.height;
D> end operator;
Read-only operator area created.
D> operator area(c circle) returns integer;
D> return c.radius * 710 / 113;
D> end operator;
Read-only operator area created.
D> var s2 shape init rectangle(3,4);
D> io.put(area(s2)); io.put_line('');
12
D> s2 := circle(5);
1 element affected.
D> io.put(area(s2)); io.put_line('');
31
</pre>

<h3>Subtyping with update operators</h3>

<p>Example:



<h2 id="exception">Exception handling</h2>

<p>By default, if an error occurs, execution stops.

<p>In Duro D/T, it is possible to handle errors and to continue execution.
It is also possible to generate errors from user code.

<h3>RAISE</h3>

<p>The RAISE statement generates an error. It can take any argument and will use it as an error
value:

<pre>
D> raise 2;
integer
D>
</pre>

<p>If an error is not handled, execution stops and the error type
is printed to standard output. This is why we see "integer" appear.

<p>Raising a system-provided error:

<pre>
D> raise name_error('test');
name_error: test
D>
</pre>

<p>If the error type has a <var>msg</var> property, its value is printed together with the type.
See the <a href="../api/html/builtin-types.html">built-in types</a>
for a list of system-provided error types.

<h3>TRY .. CATCH</h3>

<p>TRY .. CATCH can be used to catch errors that may be raised during execution.
A TRY block must contain one or more CATCH statements.

<p>The following code illustrates catching errors using TRY .. CATCH:

<pre>
try

/* Perform operations that could throw errors */

...

catch err invalid_argument_error;

  /* Handle invalid_argument_error */

...

catch err;

  /* Handle remaining errors */

...

end try;
</pre>

<p>Note that there must at least one statement between CATCH and END TRY.

<h2 id="packages">Packages</h2>

<p>Operators, types, and public tables can be organized in packages.

<p>A package consists of a definition and an (optional) implementation part.
Database tables cannot be part of a package.

<p>In practice, it may be a good idea to clearly distinguish between
application packages containing application code and public tables on the one hand
and 'base packages' containing types and operators used in databases on the other,
avoiding a mutual dependency between databases and packages.

<p>Example:

<pre>
package emp;

    type empno possrep { no int } init emp.empno(0);

end package;

implement package emp;

    implement type empno;
    end implement;

end implement;

var employees real relation { empno emp.empno, name string } key { empno };

package empapp;

    var employees public relation { empno emp.empno, name string } key { empno };

    operator print_employees() updates {};
        var tp tuple same_heading_as(empapp.employees);

        for tp in empapp.employees order (name asc);
            io.put(tp.empno.no);
            io.put(' ');
            io.put_line(tp.name);
        end for;
    end operator;

end package;

implement package empapp;

    map employees employees;

end implement;
</pre>

<p>Operators, types, and public tables contained in a package can be dropped
by surrounding the respective DROP statements by PACKAGE .. END PACKAGE;

<p>Example:

<pre>
package empapp;

    drop operator print_employees;

end package;
</pre>

<p>DROP PACKAGE deletes a package by deleting all operators, types, and public tables the package contains.

<p>Example:

<pre>
drop package empapp;
</pre>

<h2 id="performance">Performance</h2>

<p>Duro D/T features an EXPLAIN statement which displays how a relational expression is executed.

<p>Example:

<pre>
D> var r real relation { no int, name string } key { no };
Table r created.
D> var i int;
D> for i := 1 to 10; insert r tup { no i, name cast_as_string(i) }; end for;
1 element affected.
1 element affected.
1 element affected.
1 element affected.
1 element affected.
1 element affected.
1 element affected.
1 element affected.
1 element affected.
1 element affected.
D> explain r where no = 1 order();
(r INDEX r$0) where (no = 1)
</pre>

<p>(This EXPLAIN statement is not to be confused with the EXPLAIN which displays the constraint checking performed for a statement)

<p>The output of EXPLAIN shows that Duro D/T uses the index r$0 to evaluate the expression.
This is the unique index which was created to ensure that n is a key attribute of r.

<p>Now let's try other WHERE expressions:

<pre>
D> explain r where no > 1 order();
(r) where (no > 1)
D> explain r where name = 'one' order();
(r) where (name = 'one')
</pre>

<p>For neither of these an index can be used. Not for the first,
because the system-generated index on <var>n</var> is a hash index which supports only equality,
and not for the second because there is no index on attribute <var>s</var>.
This means that DuroDBMS will scan the entire table to evaluate the expression
which is quite inefficient for large tables.

<p>We can create an index on s using the INDEX statement:  

<pre>
D> index r_name r (name);
Index r_name created.
</pre>

Now we can use the index:

<pre>
D> explain r where name = 'one' order();
(r INDEX r_name) where (name = 'one')
</pre>

As we can see in the output of the EXPLAIN statement,
DuroDBMS now uses the index r_name to evaluate the expression.

An index can be destroyed using DROP INDEX:

<pre>
D> drop index r_name;
Index r_name dropped.
</pre>

<p>INDEX is supported for physically stored database tables.
Currently real tables are physically stored and virtual tables are not,
but this may change in future versions of DuroDBMS.

<p>Note that INDEX and DROP INDEX are low-level operators;
access to them may be restricted in future versions of DuroDBMS.

</html>
